[
  {
    "id": 1,
    "name": " Modern Ceiling Spotlight Indoor with Matte Brass",
    "image": ["/Spl/1.jpg", "/Spl/1.1.jpg", "/spl/1.2.jpg"],
    "color": [
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 29.99,
    "productLink": "1",
    "category": "Spl",
    "description": "This 2-Pack ceiling spotlight combines industrial and traditional design, perfect for minimalist interiors. Each gold spotlight (4.3x4.3x5.5 inches) provides ideal lighting with adjustable, multi-directional lamp heads that rotate 350° horizontally and 90° vertically. It is compatible with 2xGU10 Max. 50W bulbs (sold separately), including LED, incandescent, and halogen bulbs, and works with a dimmer switch for customizable ambiance. Made from high-quality, corrosion-resistant metal with a matte brass finish, it’s easy to install and suitable for spaces like bedrooms, kitchens, offices, and more. Contact customer service for any issues."
  },
  {
    "id": 2,
    "name": "Copper Spotlight Surface Mounted Accent Spot Light",
    "image": ["/Spl/3.1.jpg", "/Spl/3.2.jpg", "/Spl/3.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 108.86,
    "productLink": "2",
    "category": "Spl",
    "description": "This ceiling spotlight comes with all necessary installation hardware for quick and easy setup. It is compatible with E27 incandescent, LED, or CFL bulbs (not included), with a maximum wattage of 40W. Featuring a minimalist design with adjustable 2/3/4-head spotlights, the spotlight has a durable H65 brass lamp body that’s easy to install and serves as a great alternative to traditional recessed lights. It’s suitable for lighting areas of 5-10㎡ and fits perfectly in various spaces such as living rooms, dining rooms, corridors, art galleries, and hotels. Made from refined copper, the spotlight comes in different sizes: 30CM (2-light), 30CM (3-light), and 35CM (4-light) in length, with widths and heights varying accordingly. If you have any issues with the fixture, feel free to contact customer service for a quick response within 24 hours."
  },
  {
    "id": 3,
    "name": "Arcfox Replaceable 3 Light Flush Mount Ceiling Spotlight",
    "image": ["/Spl/2.1.jpg", "/Spl/2.2.jpg", "/Spl/2.3.jpg", "/Spl/2.4.jpg"],
    "color": [
     
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 56.99,
    "productLink": "3",
    "category": "Spl",
    "description": "The 3-pack ceiling spotlight fixture comes with 3x5W LED bulbs (3000K, 60°), offering a flexible lighting solution with customizable color temperature, brightness, and beam angle, compatible with MR16 LED, CFL, and incandescent bulbs. Featuring a swivel and rotation design, the lights can rotate 350° horizontally and 90° vertically to direct the light exactly where needed. For adjustable brightness, it works with dimmable bulbs and a compatible dimmer switch (sold separately). Made from durable aluminum for efficient heat dissipation, this spotlight is backed by a 2-year warranty, with Arcfox dedicated to ensuring customer satisfaction."
  },
  {
    "id": 4,
    "name": "5W Dimmable Up Lighting with Remote Control & Timer",
    "image": ["/Spl/4.1.jpg", "/Spl/4.2.jpg", "/Spl/4.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }     
    ],
    "price": 32.99,
    "productLink": "4",
    "category": "Spl",
    "description": "Our indoor spotlights are made from premium aluminum, ensuring durability, excellent heat dissipation, and resistance to corrosion. With three adjustable color temperatures (3000K, 4000K, and 5000K) and a dimming range from 10% to 100%, you can easily customize the lighting using the included remote control. Equipped with 5W high-quality LED beads, these spotlights are more energy-efficient and brighter than traditional options, with a lifespan of up to 50,000 hours. The spotlight’s compact, minimalist design makes installation easy with a 5.9-foot power cord, and its adjustable angles allow for versatile positioning. Plus, we offer reliable customer support for any issues you may encounter."
  },
  {
    "id": 5,
    "name": "WAC Lighting, Monopoint 007 Spot Light in Brushed Nickel",
    "image": ["/Spl/5.1.jpg", "/Spl/5.2.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 58.35,
    "productLink": "5",
    "category": "Spl",
    "description": "This fixture features a die-cast aluminum construction with a bi-pin ceramic socket and 18 gauge Teflon insulated wires, protected by fiberglass sleeves. It comes with a tempered clear glass lens, and special lens types such as spread lenses and UV lenses can be used. The fixture can be mounted on the ceiling or wall, with a 120V transformer in the canopy (requiring a minimum load of 1 watt for LED lamps). It offers smooth, continuous dimming to 10% when paired with an electronic low voltage dimmer. The fixture accepts one 12V LED MR16 or Halogen MR16 lamp, with a maximum power of 50W. The 007LED version includes an LED lamp, while the 007 non-LED version requires the lamp to be purchased separately. The fixture dimensions are 6.5 inches high by 4.5 inches wide and requires a 50W MR16 Halogen bulb."
  },
  {
    "id": 6,
    "name": "Holibanna Spotlight Jewelry Showcases Display Lighting",
    "image": ["/Spl/6.1.jpg", "/Spl/6.2.jpg", "/Spl/6.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 18.59,
    "productLink": "6",
    "category": "Spl",
    "description": "This small, bright LED spotlight is perfect for accent lighting, providing a modern touch to your home or display area. With its adjustable head design, you can easily change the lighting direction to highlight specific items. Ideal for cabinets, jewelry showcases, and small displays, it offers reliable and efficient illumination. The spotlight is anti-wear, resistant, and energy-efficient, ensuring durability and low power consumption. Its compact size makes it portable and versatile, suitable for various settings such as home dressers, cabinets, restaurants, and coffee shops. This LED spotlight brings a cozy and stylish ambiance to any space."
  },
  {
    "id": 7,
    "name": "2 Pack Uplighting Indoor Spotlight with GU10 Bulbs ",
    "image": ["/Spl/7.1.jpg", "/Spl/7.2.jpg", "/Spl/7.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 39.97,
    "productLink": "7",
    "category": "Spl",
    "description": "This dimmable indoor floor can light offers adjustable color temperatures, allowing you to switch between warm white (3000K), natural white (4000K), and cool white (6000K) to suit any mood or occasion. Featuring a sleek aluminum housing with a cylindrical design, it enhances the ambiance of your home, spotlighting wall art, plants, or trees. The upgraded floor can light includes a thin, stable base to prevent tipping and a hollow bottom design for a more attractive light effect. It comes with two 5W GU10 LED bulbs, but is also compatible with other GU10 bulbs. UL listed for durability and reliability, it includes a 5.9ft power cord with a convenient foot switch. Backed by a lifetime warranty, the light also comes with a 30-day money-back guarantee and 24-month limited warranty for peace of mind."
  },
  {
    "id": 8,
    "name": "2 Pack LED Spot Lights Indoor ",
    "image": ["/Spl/8.1.jpg", "/Spl/8.2.jpg", "/Spl/8.3.jpg"],
    "color": [
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price":28.99,
    "productLink": "8",
    "category": "Spl",
    "description": "The upgraded RGBW uplighting indoor spotlights offer dimmable lighting with 16 selectable colors and 4 dynamic modes (flash, strobe, fade, and smooth). In addition, the built-in white LED chips provide bright, everyday white lighting with 8 levels of brightness for flexible ambiance control. The plug-and-play fixtures include a mounting base with two installation options: wall/ceiling mount or table/floor placement, and feature a 90° vertical and 350° horizontal adjustable angle for versatile lighting. The set includes two infrared remote controls for easy operation, allowing you to adjust color, brightness, and modes. Ideal for living rooms, bedrooms, art displays, indoor plants, and more, this lighting is perfect for creating a festive atmosphere for Christmas or Halloween. Backed by a lifetime warranty, a 30-day money-back guarantee, and 24-month replacement support, buy with confidence."
  },
  {
    "id": 9,
    "name": "Aisilan LED Indoor White Ceiling Spot Light 9W Surface Mounted Light",
    "image": ["/Spl/9.1.jpg", "/Spl/9.2.jpg", "/Spl/9.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 46.99,
    "productLink": "9",
    "category": "Spl",
    "description": "The Aisilan LED Ceiling Spotlight offers dimmable triac technology with a wide range (10%-100%), ensuring seamless compatibility with dimmer switches. Crafted from durable aluminum with a sandblasted finish, it features an original, patent-protected design and a high light transmission polyester convex lens for optimal illumination. The unique off-axis design provides 360-degree three-dimensional rotation, making it perfect for accent lighting, highlighting artwork, or enhancing ambiance. Powered by a 9W LED chip (equivalent to a 90W incandescent bulb) with a 38° beam angle and a CRI of 97, it delivers accurate color representation, eye protection, and a 50,000-hour lifespan. Installation is simple with the included optional 4-inch electrical box cover—mount, connect, and secure for an efficient and stylish lighting solution."
  },
  {
    "id": 10,
    "name": "Small Spotlight Battery Operated Accent Light with Remote",
    "image": ["/Spl/10.1.jpg", "/Spl/10.2.jpg", "/Spl/10.3.jpg", "/Spl/10.4.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 19.99,
    "productLink": "10",
    "category": "Spl",
    "description": "The cordless battery-operated indoor spotlights offer easy installation and convenience, featuring a remote control for on/off, dimming (10%-100%), and timer functions (30 or 60 minutes). Compact and versatile, these spotlights provide 60 lumens of warm white (3000K) and 12 RGB colors, perfect for accenting artwork, holiday decor, or creating mood lighting. The durable, rotatable metal head swivels 350° and tilts 200°, ideal for closets, cabinets, galleries, and more. Install easily with adhesive or screws on various surfaces. Backed by years of LED expertise, these spotlights ensure quality and reliable service."
  },
  {
    "id": 11,
    "name": "Solar Spot Lights Outdoor Waterproof 4 Pack IP65",
    "image": ["/Spl/11.1.jpg", "/Spl/11.2.jpg", "/Spl/11.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 29.99,
    "productLink": "11",
    "category": "Spl",
    "description": "The AUDERWIN Solar Spotlight features 63 high-power LEDs emitting 6500K daylight, perfect for illuminating your garden, driveway, or home exterior. It offers 3 brightness modes, with High Light Mode operating at 100% brightness for 4 hours before gradually dimming. Equipped with efficient polycrystalline silicon solar panels for high energy conversion and durability, it ensures long-lasting performance. Its IP65 waterproof rating and robust ABS material withstand extreme weather conditions (-4℉~140℉). Easy to install as a landscape or wall light, it’s backed by a 12-month worry-free guarantee and friendly customer service."
  },
  {
    "id": 12,
    "name": "Kaxiida Solar Spot Lights Outdoor Waterproof",
    "image": ["/Spl/12.1.jpg", "/Spl/12.2.jpg", "/Spl/12.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 49.99,
    "productLink": "12",
    "category": "Spl",
    "description": "Solar spotlights with 56 LEDs and a 1200mAh battery deliver exceptional brightness and prolonged illumination. Powered by adjustable solar panels, they save energy while offering 3 lighting modes (dim, bright, highlight) for up to 10 hours. Featuring a 2-in-1 design, they can be ground-mounted or wall-mounted, ideal for gardens, patios, driveways, and more. Made with durable ABS and IP68 waterproofing, these lights withstand all weather conditions."
  },
  {
    "id": 13,
    "name": "LED Flood Light Outdoor 30W",
    "image": ["/Spl/13.1.jpg", "/Spl/13.2.jpg", "/Spl/13.3.jpg"],
    "color": [
      
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
      
    ],
    "price": 69.99,
    "productLink": "13",
    "category": "Spl",
    "description": "Smart Bluetooth floodlights (30W, 2700K warm white, 3000LM) offer 16 million colors, 23 dynamic modes, and app control via Bluetooth 5.0. Features include group/single control, timing function, synchronization, and customizable DIY scenes for versatile use in daily, decorative, and security lighting. Ideal for events like parties, weddings, and holidays. Easy setup, no registration or internet needed. Backed by a 2-year warranty and 90-day money-back guarantee."
  },
  {
    "id": 14,
    "name": "INSDEA 8200W Solar Street Light Motion Sensor",
    "image": ["/Spl/14.1.jpg", "/Spl/14.2.jpg", "/Spl/14.3.jpg"],
    "color": [
      
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 149.98,
    "productLink": "14",
    "category": "Spl",
    "description": "The 8200W solar street light provides 820,000LM brightness with 5730 LED lamp beads and a 50,000mAh battery, offering 15–24 hours of illumination after 6–10 hours of charging. It features 3 lighting modes: motion sensor, timed lighting, and adjustable always-on brightness. Easy to install with no wiring required, it's suitable for walls, trees, or poles (1.5–4 inches diameter). With IP66 waterproofing and resistance to harsh weather, it includes light-sensing automation, a 25-ft remote control, and 365-day operation. Comes with a 60-day replacement and 12-month after-sales service."
  },
  {
    "id": 15,
    "name": "LED Flood Light 50W/40W/30W, 3CCT 3000K/4000K/5000K Selectable",
    "image": ["/Spl/15.1.jpg", "/Spl/15.2.jpg", "/Spl/15.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 49.99,
    "productLink": "15",
    "category": "Spl",
    "description": "The adjustable LED flood light offers 50W/40W/30W brightness levels, producing up to 6500 lumens with a high efficacy of 130lm/W. It features 3 color temperatures (3000K, 4000K, 5000K) to suit various outdoor settings. An optional dusk-to-dawn photocell automates operation based on ambient light. Made of durable, corrosion-resistant aluminum, it includes a 180° adjustable arm and a 120° wide beam angle, perfect for ground, wall, or eave installation. Backed by a 5-year warranty, it's ideal for security, gardens, driveways, and more."
  },
  {
    "id": 16,
    "name": "12W RGBW LED Spot Lights Outdoor with 16 Color Changing for Yard Garden Decor",
    "image": ["/Spl/16.1.jpg", "/Spl/16.2.jpg", "/Spl/16.3.jpg"],
    "color": [
     
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 49.99,
    "productLink": "16",
    "category": "Spl",
    "description": "These RGBW outdoor spotlights feature premium SMD LED chips for high brightness, low energy consumption, and long lifespan (up to 50,000 hours). They offer 16 static colors, warm white, 4 dynamic modes, and 3 brightness levels, adjustable via RF remote with memory function for convenience. The IP65 weather-resistant design ensures durability in extreme conditions. Easy to install with a 5ft cord and US standard plug, they can be ground-inserted or wall-mounted. Backed by a 365-day money-back or free-replacement warranty."
  },
  {
    "id": 17,
    "name": "Onforu 2 Pack 60W Flood Lights Outdoor",
    "image": ["/Spl/17.1.jpg", "/Spl/17.2.jpg", "/Spl/17.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 53.34,
    "productLink": "17",
    "category": "Spl",
    "description": "The 60W Onforu LED floodlight delivers 6000 lumens of brightness, equivalent to 400W traditional bulbs, saving 85% on energy costs. Featuring 3 adjustable light heads with 270° coverage, it ensures a wide illumination range. Operated via wall switch, it lacks motion sensors or solar/dusk-to-dawn functions. Made of durable aluminum with efficient heat dissipation, it offers a long lifespan. Its IP65 waterproof rating makes it ideal for outdoor use in all weather conditions, perfect for garages, yards, and parking areas."
  },
  {
    "id": 18,
    "name": "Beams MB 410 Lumen Wireless Battery Powered Motion ",
    "image": ["/Spl/18.1.jpg", "/Spl/18.2.jpg", "/Spl/18.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 24.99,
    "productLink": "18",
    "category": "Spl",
    "description": "This ultra-bright LED spotlight provides 400 lumens of outdoor security lighting with minimal power consumption. The motion sensor automatically activates the light when needed. Designed for any climate, it features a weatherproof build for durability. Easy to install without the need for an electrician, the spotlight comes with mounting hardware. Each LED light covers up to 400 square feet and operates on four D-Cell batteries (not included)."
  },
  {
    "id": 19,
    "name": "Beams MB390 400 Lumen Wireless Battery Powered Motion ",
    "image": ["/Spl/19.1.jpg", "/Spl/19.2.jpg", "/Spl/19.3.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 24.99,
    "productLink": "19",
    "category": "Spl",
    "description": "This next-generation battery-powered LED spotlight delivers 200 lumens of bright outdoor lighting. Its unique reflective face spreads the light for wider coverage, ideal for large areas. The durable, weatherproof design ensures reliable performance outdoors. With motion activation, auto shut-off, and a light sensor, it helps prolong battery life, offering about 1 year of light with average use of 8-10 activations per day. Easy to install wirelessly in under 5 minutes, with no electrician required, making it perfect for anywhere around the home and yard."
  },
  {
    "id": 20,
    "name": "Solar Spot Lights Outdoor Waterproof 4 Pack IP6",
    "image": ["/Spl/20.1.jpg", "/Spl/20.2.jpg", "/Spl/20.3.jpg", "/Spl/20.4.jpg"],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 29.99,
    "productLink": "20",
    "category": "Spl",
    "description": "The AUDERWIN Solar Spotlight features 63 high-power LEDs that emit bright 6500K daylight, perfect for illuminating front doors, gardens, driveways, walkways, trees, fences, and houses. It offers three brightness modes: low (24hrs), medium (18hrs), and high (12hrs), with the high mode operating at 100% brightness for 4 hours, then dimming to 40% for 2 hours, and finally to 20%. The polycrystalline silicon solar panels have a 25% energy conversion rate and a longer lifespan. With IP65 waterproof rating, it performs well in all weather conditions, from rain to snow, and operates in temperatures from -4℉ to 140℉. Installation is easy, and it can function as either a landscape or wall light. The product includes a 12-month warranty and friendly customer service."
  }
,
  {
    "id": 21,
    "name": "Respiro LED Smart Ceiling Fandelier",
    "image": [
      "/SL/01repi.jpg",
      "/SL/02repi.jpg",
      "/SL/03repi.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 18.00,
    "productLink": "21",
    "category": "Sl",
    "description": "Combining the look of handcrafted rattan with warm distressed bronze, this leading-edge fan blends in seamlessly with your outdoor space. A great choice for open-air porches, this fan is treated to prevent weather damage. Optimized with Wifi connectivity and contemporary integrated tunable LED technology."
  },


  {
    "id": 22,
    "name": "WIZ Smart Bulb Ampoule Intelligente",
    "image": [
      "/SL/04am.jpg",
      "/SL/05am.jpg",
      "/SL/06am.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 10.99,
    "productLink": "22",
    "category": "Sl",
    "description": "Smart LED bulb with adjustable brightness and color temperature, compatible with voice control and smartphone apps for effortless customization."
  },


  {
    "id": 23,
    "name": "Meross Smart LED Light Bulb",
    "image": [
      "/SL/07me.jpg",
      "/SL/08me.jpg",
      "/SL/09me.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 28.99,
    "productLink": "23",
    "category": "Sl",
    "description": "The Meross Smart LED Light Bulb offers customizable brightness, color temperature, and vibrant RGB lighting. Compatible with Alexa, Google Assistant, and smartphone apps, it allows easy remote control and scheduling. Energy-efficient and long-lasting, it’s perfect for creating the ideal ambiance in any space."
  },


  {
    "id": 24,
    "name": "RCA Smart Light Bulbs, Multicolor LED",
    "image": [
      "/SL/10rca.jpg",
      "/SL/11rca.jpg",
      "/SL/12rca.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 20.00,
    "productLink": "24",
    "category": "Sl",
    "description": "RCA Smart Light Bulbs provide energy-efficient lighting with customizable brightness, color temperature, and millions of vibrant RGB colors. Compatible with Alexa and Google Assistant, they allow seamless voice control, scheduling, and remote operation via a smartphone app. Perfect for creating personalized lighting experiences in any space."
  },


  {
    "id": 25,
    "name": "Nanoleaf Essential Smart Bulb E27",
    "image": [
      "/SL/13nano.jpg",
      "/SL/14nano.jpg",
      "/SL/15nano.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 15.32,
    "productLink": "25",
    "category": "Sl",
    "description": "The Nanoleaf Essential Smart Bulb E27 offers a vibrant, energy-efficient lighting experience with adjustable brightness, tunable white (warm to cool), and a full RGB color spectrum. It supports Thread technology for faster, more reliable connections and can be controlled via the Nanoleaf app, voice commands (compatible with Apple HomeKit, Google Assistant), or manual adjustments. Ideal for enhancing any room with dynamic and customizable lighting."
  },


  {
    "id": 26,
    "name": "TRÅDFRI Starter kit, smart wireless dimmable/white spectrum, E27",
    "image": [
      "/SL/16df.jpg",
      "/SL/17df.jpg",
      "/SL/18df.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 19.75,
    "productLink": "26",
    "category": "Sl",
    "description": "The TRÅDFRI Starter Kit with E27 bulb includes everything you need to set up smart lighting in your home. It features a wireless dimmable smart bulb with adjustable white spectrum (from warm to cool light) and a remote control for easy operation. The kit is compatible with the IKEA Home smart app and supports integration with Alexa, Google Assistant, and Apple HomeKit for voice and remote control. Perfect for creating a comfortable and customizable lighting atmosphere."
  },


  {
    "id": 27,
    "name": "TRÅDFRI LED bulb E27 806 lume",
    "image": [
      "/SL/19lu.jpg",
      "/SL/20lu.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 13.50,
    "productLink": "27",
    "category": "Sl",
    "description": "The TRÅDFRI LED bulb E27 806 lumen offers both wireless dimmable control and a versatile color spectrum ranging from warm white to cool white, as well as a range of vibrant colors. With its globe opal white design, it provides soft, diffused lighting suitable for various home environments. The bulb can be easily controlled via the IKEA Home smart app, remote control, or compatible voice assistants like Alexa, Google Assistant, and Apple HomeKit."
  },


  {
    "id": 28,
    "name": "TRÅDFRI LED bulb E27 470 lumen",
    "image": [
      "/SL/21cl.jpg",
      "/SL/22cl.jpg",
      "/SL/23cl.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 10.39,
    "productLink": "28",
    "category": "Sl",
    "description": "The TRÅDFRI LED bulb E27 470 lumen offers smart, wireless dimmable functionality with a warm white light. Its globe shape provides soft, clear illumination, making it ideal for cozy, ambient lighting in any room. Compatible with the IKEA Home smart app and voice control through Alexa, Google Assistant, and Apple HomeKit, this bulb is perfect for customizable and efficient lighting experiences."
  },


  {
    "id": 29,
    "name": "4 Watt E12 Candelabra Base LED Bulb",
    "image": [
      "/SL/24sp.jpg",
      "/SL/25sp.jpg",
      "/SL/26sp.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 12.46,
    "productLink": "29",
    "category": "Sl",
    "description": "The TRÅDFRI LED bulb E27 470 lumen offers smart, wireless dimmable functionality with a warm white light. Its globe shape provides soft, clear illumination, making it ideal for cozy, ambient lighting in any room. Compatible with the IKEA Home smart app and voice control through Alexa, Google Assistant, and Apple HomeKit, this bulb is perfect for customizable and efficient lighting experiences."
  },


  {
    "id": 30,
    "name": "TRÅDFRI LED bulb E14 250 lumen",
    "image": [
      "/SL/27ch.jpg",
      "/SL/28ch.jpg",
      "/SL/29ch.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 9.35,
    "productLink": "30",
    "category": "Sl",
    "description": "The TRÅDFRI LED bulb E14 250 lumen provides smart, wireless dimmable control with a warm white light, ideal for chandelier fixtures and other decorative lighting. Its compact size ensures a perfect fit for small sockets while delivering cozy, ambient illumination. The bulb is compatible with the IKEA Home smart app and works seamlessly with voice control through Alexa, Google Assistant, and Apple HomeKit for easy and convenient operation."
  },


  {
    "id": 31,
    "name": "LED bulb E14 470 lumen",
    "image": [
      "/SL/30tr.jpg",
      "/SL/31tr.jpg",
      "/SL/32tr.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 9.35,
    "productLink": "31",
    "category": "Sl",
    "description": "The TRÅDFRI LED bulb E14 470 lumen offers wireless dimmable control with a white spectrum, providing a range of adjustable tones from warm white to cool white. Designed for chandelier fixtures and other decorative lighting, its opal white globe design diffuses the light beautifully, creating a soft and elegant ambiance. This bulb is compatible with the IKEA Home smart app and works seamlessly with Alexa, Google Assistant, and Apple HomeKit for effortless control."
  },


  {
    "id": 32,
    "name": "TRÅDFRI LED bulb E27 470 lumen",
    "image": [
      "/SL/33gl.jpg",
      "/SL/34gl.jpg",
      "/SL/35gl.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 15.58,
    "productLink": "32",
    "category": "Sl",
    "description": "The TRÅDFRI LED bulb E27 470 lumen offers smart wireless dimmable control with a white spectrum, ranging from warm to cool light. Its globe shape provides soft, diffused illumination, making it perfect for creating a cozy and inviting atmosphere. This bulb is compatible with the IKEA Home smart app and integrates seamlessly with voice control through Alexa, Google Assistant, and Apple HomeKit for easy customization."
  },


  {
    "id": 33,
    "name": "JETSTRÖM  LED ceiling light panel",
    "image": [
      "/SL/36je.jpg",
      "/SL/37je.jpg",
      "/SL/38je.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 72.77,
    "productLink": "33",
    "category": "Sl",
    "description": "The JETSTRÖM LED ceiling light panel offers smart dimmable control with a white spectrum, ranging from warm white to cool white tones. Its sleek and modern design provides even, ambient illumination, making it suitable for various rooms in the home or office. The panel is compatible with the IKEA Home smart app and supports voice control through Alexa, Google Assistant, and Apple HomeKit, allowing for easy customization and convenient operation."
  },


  {
    "id": 34,
    "name": "GE Cync A19 Smart LED Light Bulb",
    "image": [
      "/SL/39ge.jpg",
      "/SL/40ge.jpg",
      "/SL/41ge.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 13.00,
    "productLink": "34",
    "category": "Sl",
    "description": "The GE Cync A19 Smart LED Light Bulb provides soft white lighting with the convenience of smart home automation. It connects via WiFi and is compatible with Alexa and Google Home, enabling voice control and seamless integration into your smart home ecosystem. This energy-efficient bulb offers customizable brightness and color temperature, creating a comfortable and personalized lighting experience."
  },


  {
    "id": 35,
    "name": "GE Cync G25 Smart LED Light Bulbs",
    "image": [
      "/SL/42cy.jpg",
      "/SL/43cy.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 13.00,
    "productLink": "35",
    "category": "Sl",
    "description": "The GE Cync G25 Smart LED Light Bulbs are decorative globe bulbs offering soft white lighting with smart home functionality. These bulbs connect seamlessly to WiFi and are compatible with Alexa and Google Home for easy voice control and automation. They provide customizable brightness and color temperature, making them ideal for enhancing any room's ambiance with a warm, inviting glow."
  },


  {
    "id": 36,
    "name": " Soft White Decorative Candle Light",
    "image": [
      "/SL/44sm.jpg",
      "/SL/45sm.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 14.00,
    "productLink": "36",
    "category": "Sl",
    "description": "The GE Cync Smart LED Light Bulb is a soft white decorative candle light designed for medium bases. It provides a warm and inviting ambiance while offering smart home functionality. The bulb connects seamlessly with WiFi and works with Alexa and Google Home for voice control and automation. You can customize its brightness and color temperature to suit any mood or occasion."
  },


  {
    "id": 37,
    "name": "Tapo LB100 Dimmable LED WiFi 800LB TUNABLE",
    "image": [
      "/SL/46tapo.jpg",
      "/SL/47tapo.jpg",
      "/SL/48tapo.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 20.00,
    "productLink": "37",
    "category": "Sl",
    "description": "The Tapo LB100 Dimmable LED WiFi Smart Bulb offers tunable white and multicolor lighting with a brightness of 600 lumens. It allows you to control your lighting via WiFi, providing customizable color temperature and brightness levels. Compatible with smart home systems, including Alexa and Google Home, the bulb is perfect for creating the ideal ambiance for any occasion."
  },


  {
    "id": 38,
    "name": "LIFX 1100-Lumen",
    "image": [
      "/SL/49lifx.jpg",
      "/SL/50lifx.jpg",
      "/SL/51lifx.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 40.00,
    "productLink": "38",
    "category": "Sl",
    "description": "The LIFX 1100-Lumen, 11W Dimmable A19 LED Light Bulb (LHA19E26UC10) offers vibrant multi-colored lighting with a brightness equivalent to a 75W incandescent bulb. It provides rich, customizable color options and adjustable brightness levels. This smart bulb integrates seamlessly with WiFi, allowing for easy control through the LIFX app or compatibility with voice assistants like Alexa, Google Home, and Apple HomeKit for a more personalized lighting experience."
  },


  {
    "id": 39,
    "name": "New Kasa Smart Bulb",
    "image": [
      "/SL/52kasa.jpg",
      "/SL/53kasa.jpg",
      "/SL/54kasa.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 15.00,
    "productLink": "39",
    "category": "Sl",
    "description": "The New Kasa Smart Bulb, model KL125, is a full-color changing dimmable smart WiFi light bulb with a brightness of 800 lumens and a power rating of 9 watts. It is compatible with Alexa and Google Home, allowing for easy voice control and automation. This bulb supports a wide range of colors and adjustable brightness levels, offering a versatile lighting experience. No hub is required for setup, and it operates on a 2.4GHz WiFi connection."
  },


  {
    "id": 40,
    "name": "Calex Smart B22 A60 RGB & White LED Light Bulb 9.4W 806lm",
    "image": [
      "/SL/55py.jpg",
      "/SL/56py.jpg",
      "/SL/57py.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 20.00,
    "productLink": "40",
    "category": "Sl",
    "description": "The Calex Smart B22 A60 RGB & White LED Light Bulb offers 9.4 watts of power with a brightness of 806 lumens. This smart bulb supports both RGB and white light settings, allowing for customizable color options and adjustable brightness. It can be controlled via WiFi or smart home systems like Alexa and Google Home for seamless integration and automation."
  },





  {
    "id": 41,
    "name": "Arisha Pendant Light Outer Ring Illuminated, 2/3/4 Rings",
    "image": [
      "/DL/01a.jpg",
      "/DL/01a.jpg",
      "/DL/01a.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 113.95,
    "productLink": "41",
    "category": "Dl",
    "description": "A modern minimalist style lamp perfect for various spaces such as living rooms, restaurants, dining rooms, kitchens, bedrooms, and more."
  },

  
  {
    "id": 42,
    "name": "6 Watt G25 Globe Medium Base LED Bulb - Clear",
    "image": [
      "/DL/04b.jpg",
      "/DL/05b.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Red",
        "style": {
          "backgroundColor": "#FF0000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Green",
        "style": {
          "backgroundColor": "#00FF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Blue",
        "style": {
          "backgroundColor": "#0000FF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 35.00,
    "productLink": "42",
    "category": "Dl",
    "description": "The JIAMEI 20FT RGB LED Strip Lights are flexible neon rope lights with vibrant color options. They feature app control, an IR remote, and music syncing capabilities, making them perfect for bedroom, gaming setups, parties, and outdoor use. With an IP67 waterproof rating, they are suitable for both indoor and outdoor applications. The strip lights are cuttable, allowing customization to fit various spaces and designs."
  },

  
  {
    "id": 43,
    "name": "Led String Lights for Aesthetic Room Decor Items",
    "image": [
      "/DL/06c.jpg",
      "/DL/07c.jpg",
      "/DL/08c.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Red",
        "style": {
          "backgroundColor": "#FF0000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Green",
        "style": {
          "backgroundColor": "#00FF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Blue",
        "style": {
          "backgroundColor": "#0000FF",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 20.00,
    "productLink": "43",
    "category": "Dl",
    "description": "LED String Lights for Aesthetic Room Decor Items are perfect for adding a warm and cozy ambiance to any room. These lights are designed for aesthetic appeal and are ideal for decorating bedrooms, living rooms, parties, or special events. Flexible and lightweight, they are easy to hang, shape, and adjust to suit various spaces and themes."
  },


  {
    "id": 44,
    "name": "10 Meters Non-Extendable LED String Festival Light Lights European Plug",
    "image": [
      "/DL/09d.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Red",
        "style": {
          "backgroundColor": "#FF0000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Green",
        "style": {
          "backgroundColor": "#00FF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Blue",
        "style": {
          "backgroundColor": "#0000FF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 762.34,
    "productLink": "44",
    "category": "Dl",
    "description": "The 10 Meters Non-Extendable LED String Festival Light with European Plug is ideal for decorating your home, parties, weddings, and festive celebrations. It features a 10-meter string of energy-efficient LED bulbs, perfect for creating a warm and inviting atmosphere indoors or outdoors. Easy to install and reliable, it enhances any space with its sparkling charm."
  },


  {
    "id": 45,
    "name": "Home Decoration Light 80 Led- Golden, Golden Fairy String Lights Christmas",
    "image": [
      "/DL/10e.jpg"
    ],
    "color": [
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 70.00,
    "productLink": "45",
    "category": "Dl",
    "description": "The Home Decoration Light 80 LED - Golden Fairy String Lights is perfect for creating a warm and festive atmosphere. Ideal for Christmas, Eid, birthdays, weddings, and other celebrations, these fairy lights are designed for room decoration or outdoor use, offering a soft golden glow to enhance any space's charm and elegance."
  },


  {
    "id": 46,
    "name": "Tira LED estilo neón CA 220 V",
    "image": [
      "/DL/11f.jpg",
      "/DL/12f.jpg",
      "/DL/13f.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Red",
        "style": {
          "backgroundColor": "#FF0000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Green",
        "style": {
          "backgroundColor": "#00FF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Blue",
        "style": {
          "backgroundColor": "#0000FF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Pink",
        "style": {
          "backgroundColor": "#FFC0CB",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 31.99,
    "productLink": "46",
    "category": "Dl",
    "description": "Tira LED estilo neón CA 220 V is a modern LED neon light, using a 220V power source, with a flexible design that can be easily bent to fit various decorations. This light is ideal for creating artistic lighting effects, home decor, event spaces, cafes, or outdoor areas. It is easy to install and can be waterproof (depending on the specific version), making it suitable for both indoor and outdoor spaces."
  },

  
  {
    "id": 47,
    "name": "Applique murale de vanité en métal linéaire minimaliste Alana pour salle de bain",
    "image": [
      "/DL/14j.jpg",
      "/DL/15j.jpg",
      "/DL/16j.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 277.43,
    "productLink": "47",
    "category": "Dl",
    "description": "The Alana minimalist metal vanity wall light for the bathroom offers a sleek and minimalist design, perfect for bathroom vanity lighting. This wall-mounted metal light is both functional and enhances the aesthetic of any modern bathroom space. It typically features a warm, neutral color palette such as brushed nickel, black, or matte white."
  },


  {
    "id": 48,
    "name": "Applique murale rotative créative ronde",
    "image": [
      "/DL/17g.jpg",
      "/DL/18g.jpg",
      "/DL/19j.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 15.53,
    "productLink": "48",
    "category": "Dl",
    "description": "This creative round rotating wall sconce features a unique and modern design with a circular base. It offers adjustable lighting to suit your needs with its rotating functionality, making it ideal for various spaces such as the living room, bedroom, or office. Its contemporary finish seamlessly fits into various interior styles."
  },


  {
    "id": 49,
    "name": "Jolie lampe murale en forme de citrouille jaune",
    "image": [
      "/DL/20h.jpg",
      "/DL/21h.jpg",
      "/DL/22h.jpg"
    ],
    "color": [
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 15.00,
    "productLink": "49",
    "category": "Dl",
    "description": "Jolie lampe murale en forme de citrouille jaune: This elegant pumpkin-shaped wall lamp in yellow brings a warm and inviting touch to your space. Perfect for creating a cozy ambiance in the bedroom, living room, or dining area."
  },


  {
    "id": 50,
    "name": "RGB Wall Light Intelligent Remote Control Decoration Wall Lamp",
    "image": [
      "/DL/23i.jpg",
      "/DL/24i.jpg",
      "/DL/25i.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Red",
        "style": {
          "backgroundColor": "#FF0000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Green",
        "style": {
          "backgroundColor": "#00FF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Blue",
        "style": {
          "backgroundColor": "#0000FF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Pink",
        "style": {
          "backgroundColor": "#FFC0CB",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 38.00,
    "productLink": "50",
    "category": "Dl",
    "description": "This RGB intelligent wall lamp is controllable via remote, perfect for adding a modern and decorative touch to your spaces. Ideal for the bedroom, living room, or office, it provides customizable ambiance with its various colors and lighting effects."
  },


  {
    "id": 51,
    "name": "Ong Strip Living Room Stairs Outdoor Aisle Stainless Steel Crystal Wall Sconces",
    "image": [
      "/DL/26k.jpg",
      "/DL/27k.jpg",
      "/DL/28k.jpg",
      "/DL/29k.jpg"
    ],
    "color": [
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 354.99,
    "productLink": "51",
    "category": "Dl",
    "description": "These stainless steel crystal wall sconces are perfect for adding an elegant and sophisticated touch to various spaces such as living rooms, stairs, outdoor aisles, and hallways. They provide soft, decorative lighting with their unique design."
  },


  {
    "id": 52,
    "name": "Nordic 180° Rotatable Adjustable LED Rotary Switch Wall Lamp for Bedside Aisle",
    "image": [
      "/DL/30l.jpg",
      "/DL/31l.jpg",
      "/DL/32l.jpg"
    ],
    "color": [
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 97.00,
    "productLink": "52",
    "category": "Dl",
    "description": "The Nordic 180° Rotatable Adjustable LED Rotary Switch Wall Lamp for Bedside Aisle features a modern, stylish design with a 180-degree rotatable feature, making it ideal for bedside or aisle lighting. It provides adjustable brightness and flexibility to suit various lighting needs, while enhancing the aesthetic appeal of any room."
  },


  {
    "id": 53,
    "name": "Nordic 180° Rotatable Adjustable LED Rotary Switch Wall Lamp for Bedside Aisle",
    "image": [
      "/DL/33m.jpg",
      "/DL/34m.jpg",
      "/DL/35m.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 14.00,
    "productLink": "53",
    "category": "Dl",
    "description": "The Nordic 180° Rotatable Adjustable LED Rotary Switch Wall Lamp for Bedside Aisle features a modern, stylish design with a 180-degree rotatable feature, making it ideal for bedside or aisle lighting. It provides adjustable brightness and flexibility to suit various lighting needs, while enhancing the aesthetic appeal of any room."
  },


  {
    "id": 54,
    "name": "Applique Murale d'extérieur Minimaline Edge, noir, or et argent, 28 cm/40 cm/60 cm de long",
    "image": [
      "/DL/36n.jpg",
      "/DL/37n.jpg",
      "/DL/38n.jpg",
      "/DL/39n.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 24.00,
    "productLink": "54",
    "category": "Dl",
    "description": "The Applique murale d'extérieur minimaliste Edge is a sleek and modern outdoor wall lamp featuring a minimalist design. It is available in black, gold, and silver color options and comes in lengths of 28 cm, 40 cm, or 60 cm, making it versatile for various outdoor spaces like patios, gardens, and walkways."
  },


  {
    "id": 55,
    "name": "Applique murale d'extérieur minimaliste Edge, noir, or et argent, 28 cm/40 cm/60 cm de long",
    "image": [
      "/DL/40o.jpg",
      "/DL/41o.jpg",
      "/DL/42o.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 14.50,
    "productLink": "55",
    "category": "Dl",
    "description": "The Applique murale d'extérieur minimaliste Edge is a sleek and modern outdoor wall lamp featuring a minimalist design. It is available in black, gold, and silver color options and comes in lengths of 28 cm, 40 cm, or 60 cm, making it versatile for various outdoor spaces like patios, gardens, and walkways."
  },


  {
    "id": 56,
    "name": "Applique murale en cristal à tête unique, lampe de chevet européenne pour salon et chambre à coucher",
    "image": [
      "/DL/43p.jpg",
      "/DL/44p.jpg",
      "/DL/45p.jpg"
    ],
    "color": [
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 10.00,
    "productLink": "56",
    "category": "Dl",
    "description": "This crystal wall lamp offers an elegant and sophisticated design, perfect for the living room or bedroom. It combines functionality and aesthetics with a soft and warm light."
  },


  {
    "id": 57,
    "name": "330° Rotatable Rounded Rectangular LED Nordic Wall Lamp Wall Sconce Lighting",
    "image": [
      "/DL/46q.jpg",
      "/DL/47q.jpg",
      "/DL/48q.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 123.00,
    "productLink": "57",
    "category": "Dl",
    "description": "The 330° Rotatable Rounded Rectangular LED Nordic Wall Lamp Wall Sconce Lighting features a modern, sleek design with a rotatable head, allowing flexibility in lighting direction. It's ideal for adding both functional and decorative lighting to spaces such as living rooms, bedrooms, and hallways."
  },


  {
    "id": 58,
    "name": "Eala Wall Lamp",
    "image": [
      "/DL/49r.jpg",
      "/DL/50r.jpg",
      "/DL/51r.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Yellow",
        "style": {
          "backgroundColor": "#FFFF00",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 168.00,
    "productLink": "58",
    "category": "Dl",
    "description": "The Eala Wall Lamp features a modern and elegant design that complements various interior styles. It provides both ambient and task lighting, making it versatile for use in living rooms, bedrooms, or hallways."
  },


  {
    "id": 59,
    "name": "Basilica Wall Lamp",
    "image": [
      "/DL/52s.jpg",
      "/DL/53s.jpg",
      "/DL/54s.jpg"
    ],
    "color": [
      {
        "value": "White",
        "style": {
          "backgroundColor": "#FFFFFF",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 128.00,
    "productLink": "59",
    "category": "Dl",
    "description": "The Basilica Wall Lamp is a stylish and elegant lighting fixture designed to provide both functional and decorative lighting. Its design often features a combination of sophisticated materials and a refined silhouette, making it suitable for enhancing the ambiance of various spaces such as living rooms, bedrooms, and hallways."
  },


  {
    "id": 60,
    "name": "Swing Long Arm Austere Wall Lamp - Black/Gold",
    "image": [
      "/DL/55t.jpg",
      "/DL/56t.jpg",
      "/DL/57t.jpg"
    ],
    "color": [
      {
        "value": "Black",
        "style": {
          "backgroundColor": "#000000",
          "border": "1px solid #ccc"
        }
      },
      {
        "value": "#CD9575",
        "style": {
          "backgroundColor": "#CD9575",
          "border": "1px solid #ccc"
        }
      }
    ],
    "price": 337.99,
    "productLink": "60",
    "category": "Dl",
    "description": "The Swing Long Arm Austere Wall Lamp - Black/Gold is a stylish, adjustable wall lamp with a modern, austere design. It features a long, movable arm that allows for customizable lighting angles, making it perfect for various spaces such as living rooms, bedrooms, or offices. The combination of black and gold finishes adds an elegant touch to its contemporary look."
  }
]